benchmark_results/acceptance_perf_20260304_102342.txt
# Acceptance Performance 20260304_102342

## jobs 8082
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8082

Document Path:          /api/v1/jobs
Document Length:        2462 bytes

Concurrency Level:      100
Time taken for tests:   5.593 seconds
Complete requests:      5000
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Non-2xx responses:      10
Keep-Alive requests:    10
Total transferred:      13926330 bytes
HTML transferred:       12285700 bytes
Requests per second:    893.96 [#/sec] (mean)
Time per request:       111.861 [ms] (mean)
Time per request:       1.119 [ms] (mean, across all concurrent requests)
Transfer rate:          2431.57 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.6      0       6
Processing:     1   94 149.7     66    1153
Waiting:        1   93 149.7     66    1153
Total:          1   94 149.7     66    1154

Percentage of the requests served within a certain time (ms)
  50%     66
  66%     92
  75%    108
  80%    119
  90%    159
  95%    223
  98%    391
  99%   1066
 100%   1154 (longest request)

## talents 8086
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8086

Document Path:          /api/v1/talents
Document Length:        86 bytes

Concurrency Level:      100
Time taken for tests:   4.461 seconds
Complete requests:      5000
Failed requests:        114
   (Connect: 0, Receive: 0, Length: 114, Exceptions: 0)
Non-2xx responses:      114
Keep-Alive requests:    5000
Total transferred:      2286352 bytes
HTML transferred:       424186 bytes
Requests per second:    1120.71 [#/sec] (mean)
Time per request:       89.229 [ms] (mean)
Time per request:       0.892 [ms] (mean, across all concurrent requests)
Transfer rate:          500.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0   53  86.1     33    3380
Waiting:        0   53  86.1     33    3380
Total:          0   53  86.1     33    3380

Percentage of the requests served within a certain time (ms)
  50%     33
  66%     54
  75%     69
  80%     81
  90%    118
  95%    181
  98%    267
  99%    346
 100%   3380 (longest request)

## recommendation stats 8087
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8087

Document Path:          /api/v1/recommendations/stats
Document Length:        262 bytes

Concurrency Level:      100
Time taken for tests:   2.690 seconds
Complete requests:      5000
Failed requests:        0
Keep-Alive requests:    5000
Total transferred:      3175000 bytes
HTML transferred:       1310000 bytes
Requests per second:    1858.50 [#/sec] (mean)
Time per request:       53.807 [ms] (mean)
Time per request:       0.538 [ms] (mean, across all concurrent requests)
Transfer rate:          1152.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0   53  54.6     42     514
Waiting:        0   53  54.6     42     514
Total:          0   53  54.6     42     514

Percentage of the requests served within a certain time (ms)
  50%     42
  66%     65
  75%     78
  80%     89
  90%    119
  95%    158
  98%    201
  99%    250
 100%    514 (longest request)