benchmark_results/benchmark_20260304_102249.txt
==========================================
   压测报告 - Wed Mar  4 10:22:49 CST 2026
==========================================

This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /health
Document Length:        301 bytes

Concurrency Level:      100
Time taken for tests:   0.301 seconds
Complete requests:      5000
Failed requests:        4900
   (Connect: 0, Receive: 0, Length: 4900, Exceptions: 0)
Non-2xx responses:      4900
Keep-Alive requests:    5000
Total transferred:      1063900 bytes
HTML transferred:       240800 bytes
Requests per second:    16618.75 [#/sec] (mean)
Time per request:       6.017 [ms] (mean)
Time per request:       0.060 [ms] (mean, across all concurrent requests)
Transfer rate:          3453.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     0    4  20.9      1     202
Waiting:        0    4  20.9      1     202
Total:          0    4  20.9      1     202

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      3
  95%      3
  98%      7
  99%    201
 100%    202 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/jobs
Document Length:        43 bytes

Concurrency Level:      100
Time taken for tests:   0.270 seconds
Complete requests:      5000
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Non-2xx responses:      4990
Keep-Alive requests:    4990
Total transferred:      1052300 bytes
HTML transferred:       239190 bytes
Requests per second:    18496.19 [#/sec] (mean)
Time per request:       5.407 [ms] (mean)
Time per request:       0.054 [ms] (mean, across all concurrent requests)
Transfer rate:          3801.47 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0    4  21.6      1     207
Waiting:        0    4  21.6      1     207
Total:          0    4  21.6      1     207

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      3
  95%      4
  98%      7
  99%    201
 100%    207 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/talents
Document Length:        43 bytes

Concurrency Level:      100
Time taken for tests:   1.025 seconds
Complete requests:      5000
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Non-2xx responses:      4990
Keep-Alive requests:    5000
Total transferred:      1028980 bytes
HTML transferred:       215430 bytes
Requests per second:    4878.13 [#/sec] (mean)
Time per request:       20.500 [ms] (mean)
Time per request:       0.205 [ms] (mean, across all concurrent requests)
Transfer rate:          980.37 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0    7  55.3      1    1022
Waiting:        0    7  55.3      1    1022
Total:          0    7  55.4      1    1023

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      2
  80%      2
  90%      2
  95%      4
  98%     11
  99%    202
 100%   1023 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/users/me
Document Length:        43 bytes

Concurrency Level:      100
Time taken for tests:   1.017 seconds
Complete requests:      5000
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Non-2xx responses:      5000
Keep-Alive requests:    5000
Total transferred:      1027212 bytes
HTML transferred:       214825 bytes
Requests per second:    4915.52 [#/sec] (mean)
Time per request:       20.344 [ms] (mean)
Time per request:       0.203 [ms] (mean, across all concurrent requests)
Transfer rate:          986.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.3      0       3
Processing:     0    5  42.8      1    1013
Waiting:        0    5  42.8      1    1013
Total:          0    5  42.9      1    1015

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      3
  95%      4
  98%      8
  99%    203
 100%   1015 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /api/v1/recommendations/stats
Document Length:        262 bytes

Concurrency Level:      100
Time taken for tests:   0.314 seconds
Complete requests:      5000
Failed requests:        4997
   (Connect: 0, Receive: 0, Length: 4997, Exceptions: 0)
Non-2xx responses:      4997
Keep-Alive requests:    5000
Total transferred:      1026725 bytes
HTML transferred:       215657 bytes
Requests per second:    15898.66 [#/sec] (mean)
Time per request:       6.290 [ms] (mean)
Time per request:       0.063 [ms] (mean, across all concurrent requests)
Transfer rate:          3188.19 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       2
Processing:     0    4  20.7      1     202
Waiting:        0    4  20.7      1     202
Total:          0    4  20.7      1     202

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      2
  95%      4
  98%      8
  99%    201
 100%    202 (longest request)